{
    "data": [
        {
            "id": 1,
            "name": "Spicy Salad with Kidney Beans, Cheddar, and Nuts",
            "image": "https://spoonacular.com/recipeImages/157344-312x231.jpg",
            "desc": "Rinse and drain the kidney beans, cut the sundried tomatoes, and tear the slice of cheese into small pieces. Put the mixed greens in a bowl and top with kidney beans, sundried tomatoes, cheddar cheese, and nuts. Mix together the olive oil, balsamic vinegar, and hot sauce in a small bowl. Pour the dressing over the salad. Fast, easy, and healthy-- one of my favorite lunches!"
        },
        {
            "id": 2,
            "name": "Alouette® Stuffed Mushroom Caps",
            "image": "https://spoonacular.com/recipeImages/632252-312x231.jpg",
            "desc": "Preheat oven to 375 F. Place mushroom caps hollow side up on baking sheet. Fill each cap with 1 tsp. Alouette Garlic & Herbs Spreadable Cheese and sprinkle with seasoned bread crumbs. Bake 12-15 minutes. Garnish and serve."
        },
        {
            "id": 3,
            "name": "Instant Pot Chicken Taco Soup",
            "image": "https://spoonacular.com/recipeImages/975070-312x231.jpg",
            "desc": "Press the Saute button on the Instant Pot and heat oil. Add onion and bell pepper and saute until translucent. Add tomatoes including juice and add water. Make sure to scrape all of the bits from the sides and bottom of the Instant Pot as you are stirring. Add chicken, chili powder, corn, black beans, green onions, green chilis, and  cup of cilantro. Lock lid. Press the manual or pressure cook button and set time for 15 minutes. When time is up, do a quick release until the valve drops and then unlock the lid. Shred the chicken using two forks and then let the soup simmer for 5 minutes. Serve the soup into bowls and then top with your favorite toppings such as sour cream, cheese, avocado, etc."
        },
        {
            "id": 4,
            "name": "Amaranth and Roast Veggie Salad",
            "image": "https://spoonacular.com/recipeImages/632269-312x231.jpg",
            "desc": "Cook the amaranth with about a cup of water until it reaches a sticky consistency Cut the onion roughly into chunks Add the onion and diced pumpkin to a tinfoil lined baking tray Drizzled over the olive oil and sprinkle with the herbal salt and pepper Put into a hot oven and roast until the edges of the pumpkin go crispy Just before the veggies are done, throw in the baby tomatoes Coat the veggies in the cooked amaranth Tear a few rocket leaves Toss together and there you have it, an unusual roast veggie salad! Serve warm"
        },
        {
            "id": 5,
            "name": "Ancient Grains Bread",
            "image": "https://spoonacular.com/recipeImages/632347-312x231.jpg",
            "desc": "In a large bowl or stand mixer, whisk together yeast, flours, rye flakes, flaxseed, amaranth, quinoa, soy flour, wheat gluten, skim milk powder and salt. Stir in warm water and honey, mixing thoroughly to form a cohesive, fairly firm (but workable) dough. Turn out onto a floured board or knead with the dough hook for 12 minutes, until very elastic and smooth. Place into a bowl, cover and allow to rest 30 minutes. Roll rested dough into a log shape and tuck into a greased loaf pan. Cover with a clean towel and allow to rise 50-60 minutes. Preheat oven to 350F. Slash the top of the loaf 2-3 times with a sharp knife or lame. Bake 40 minutes. Turn out of pan immediately and cool on a rack before slicing"
        },
        {
            "id": 6,
            "name": "Ancient Grains Bread",
            "image": "https://spoonacular.com/recipeImages/632347-312x231.jpg",
            "desc": "In a large bowl or stand mixer, whisk together yeast, flours, rye flakes, flaxseed, amaranth, quinoa, soy flour, wheat gluten, skim milk powder and salt. Stir in warm water and honey, mixing thoroughly to form a cohesive, fairly firm (but workable) dough. Turn out onto a floured board or knead with the dough hook for 12 minutes, until very elastic and smooth. Place into a bowl, cover and allow to rest 30 minutes. Roll rested dough into a log shape and tuck into a greased loaf pan. Cover with a clean towel and allow to rise 50-60 minutes. Preheat oven to 350F. Slash the top of the loaf 2-3 times with a sharp knife or lame. Bake 40 minutes. Turn out of pan immediately and cool on a rack before slicing"
        },
        {
            "id": 7,
            "name": "Asian Chicken and Broccoli With Chili Garlic Sauce",
            "image": "https://spoonacular.com/recipeImages/632812-312x231.jpg",
            "desc": "Combine rice vinegar, Mirin, water, chili garlic sauce, fish sauce, soy sauce and cornstarch in a bowl. Preheat a large skillet over medium-high heat and spray with cooking spray. Add sesame oil and stir fry broccoli for 3  4 minutes until crisp-tender. Add 1/4 cup chicken broth if needed to keep from burning. Add cooked chicken and sauce. Cook another 3  4 minutes until sauce thickens and chicken is heated through. Serve with basmati rice."
        },
        {
            "id": 8,
            "name": "Balsamic & Honey Glazed Salmon with Lemony Asparagus",
            "image": "https://spoonacular.com/recipeImages/633921-312x231.jpg",
            "desc": "In a small mixing bowl or blender, combine all of the ingredients for the balsamic marinade except for the lemon juice (balsamic vinegar, apple cider vinegar, 1 tbsp grapeseed oil, honey, dried dill, herbs de provence, salt and pepper). Whisk or blend until oil and vinegar are well incorporated and no longer separate. Place salmon fillet in a baking dish (I use a small casserole dish). Pour the marinade over the salmon and allow it to marinate for at least 15 minutes (or up to 24 hours covered in the refrigerator).  Turn your oven on high broil. Just before putting the salmon in the oven, drizzle the lemon juice over the fish. Bake for 10 to 12 minutes on the top rack or until salmon is glazed, browned and sizzling.While the salmon is baking, prepare the asparagus.  Wash the asparagus and cut off the bottom inch and a half of each stalk and discard. Spread the asparagus on in a large skillet. Drizzle the grapeseed oil over the asparagus and spread the oil on the asparagus with your hands so that all stalks are completely coated. Sprinkle asparagus with desired amount of salt and pepper. Saute over medium heat for 5 minutes. Add the two tablespoons of vegetable stock and cover the skillet. Saute 4 minutes. Remove lid and add the minced garlic. Place cover back over the asparagus. Continue cooking an additional 3 to 5 minutes until asparagus is cooked but not too soft.  Grate lemon zest over the top of the asparagus."
        },
        {
            "id": 9,
            "name": "Balsamic Roasted Vegetables",
            "image": "https://spoonacular.com/recipeImages/633942-312x231.jpg",
            "desc": "Clean and top the beets and, along with the fingerling potatoes, drizzle with enough olive oil just to coat. Roast whole at 400 degrees until softened, but not completely cooked (about 30 minutes). Remove from the oven and carefully peel the beets, then cut in half. You can leave the fingerlings whole, and slice lengthwise in half before serving, or halve them and continue roasting (both ways are delicious!) Quarter the fennel and red onion lengthwise, and cut the kabocha into 1/2 inch wedges. Toss all the vegetables in a bowl and drizzle enough olive oil to sufficiently coat. Then, add a big splash of balsamic vinegar (approx. 1/4 cup), a couple hearty pinches of Kosher salt, a few good turns of fresh ground black pepper, and a small sprig of fresh rosemary. Let roast another 30-40 minutes, turning every so often to get an even roast."
        },
        {
            "id": 10,
            "name": "Basil Tagliatelle with Roasted Red Bell Pepper Salad",
            "image": "https://spoonacular.com/recipeImages/634437-312x231.jpg",
            "desc": "Go to my blog for the full instructions: http://gourmandelle.com/basil-tagliatelle-with-roasted-red-bell-pepper-salad/"
        },
        {
            "id": 11,
            "name": "Broccoli Tartar",
            "image": "https://spoonacular.com/recipeImages/636228-312x231.jpg",
            "desc": "Soak arame (seaweed can be found in a health-food store) in a bowl of pure water. Put the grill of the oven and put a pot of water on the fire with a pinch of sea salt.Wash the pepper, broccoli, parsley and tomatoes. Carve a cross down the tomatoes, halve the peppers and remove the seeds and cut the broccoli into chunks.When the water boils you immerse the tomatoes and leave them for a swim, get them and let them scare in cold water. They are now ready to go out of their jackets.Meanwhile, the broccoli  can be swimming for 6 minutes in the boiling water. Note: The water will cool off and when back to a boil, then add 5 minutes. Get them dry and cool under cold water, then they stay nice and green.The pepper may be under the grill until it sees black. Let them cool and peel them.Chop the parsley. Put the cooled broccoli in a long narrow bowl and blend finely with a hand blender. Add the oil and vinegar with the salt. Add half the parsley and mix into a smooth puree. If too grainy (dry) put some extra oil. Cut the unseeded, peeled tomatoes and peppers into very small pieces.The shallot or onion may be chopped in mini pieces. Add the chopped vegetables to the puree and stir gently with a spoon. The rest of the chopped parsley may be added now. A little salt, soy sauce and chili powder. Start with a little bit and add some more later if desired. The herbs de Provence can now embellish the whole with its bright flavor.The seaweed may now well out of the water and squeeze out any excess moisture. Cut the seaweed finely and mix carefully with the puree.With an ice cream spoon you  create beautiful balls and sprinkle with toasted sesame seeds.bon apptit"
        },
        {
            "id": 12,
            "name": "Broccoli with cheese soup",
            "image": "https://spoonacular.com/recipeImages/636230-312x231.jpg",
            "desc": "Add onions and carrots to the melted butter and saute for 5-6 minutes over medium heat, or until vegetables are tender. Add 1 cup chicken broth and bring to the boil. Add broccoli and cook, covered, 5 to 6 minutes or until the broccoli is tender. Using a spoon, break broccoli florets in small pieces. Reduce heat to low and add remaining cup of chicken broth. Mix flour and milk in a small bowl and whisk until smooth. Add mixture to the pot. Add garlic powder, salt, and pepper. Continue cooking for about 5-6 minutes over low heat until soup thickens. Add cheese, handfuls at a time, and stir constantly over low heat for 10 minutes until smooth and creamy. If soup becomes too thick, add additional chicken stock. Do not let soup boil."
        },
        {
            "id": 13,
            "name": "Butternut Squash Frittata",
            "image": "https://spoonacular.com/recipeImages/636589-312x231.jpg",
            "desc": "Preheat oven to 350Spray a 10 oz oven safe dish with cooking spray Add your butternut squash In a measuring cup add your eggs and milk. Mix until combined. Pour over butternut squash. Sprinkle with pepper and top with cheese. Bake in oven for 30-35 minutes, until middle is slightly firm Let it cool for a few minutes"
        },
        {
            "id": 14,
            "name": "Butternut Squash Soup (In Half An Hour!)",
            "image": "https://spoonacular.com/recipeImages/636602-312x231.jpg",
            "desc": "In large pot, saute onion in butter, ghee or olive oil until soft Add cubed squash and saute for a couple of minutes Add vegetable stock and 1 3 inch piece of kombu and bring to a boil Reduce heat and simmer until squash is soft (about 15 minutes)Using a slotted spoon, remove squash and puree in blender Return squash to pot and stir in black-eyed peas and cooked quinoa. Add greens for about five minutes until soft Add nutmeg, sea salt and pepper to taste"
        },
        {
            "id": 15,
            "name": "Butternut Squash, Arugula and Goat Cheese Quinoa",
            "image": "https://spoonacular.com/recipeImages/636608-312x231.jpg",
            "desc": "Preheat oven to 450F. Spray a cookie sheet with nonstick spray. Toss butternut squash with about 1 tbsp olive oil (possibly less, just enough to coat) and season with salt and pepper. Spread in one layer on cookie sheet. Roast butternut squash for 20-25 minutes, until fork tender. While squash is roasting, combine quinoa and water or stock in a saucepan. If using water, season with 1/2 tsp salt. Bring to a boil, lower heat, cover and simmer for 10-15 minutes, until liquid is absorbed. In a large bowl, combine cooked quinoa, butternut squash, arugula, 1 tbsp olive oil, balsamic vinegar and crumbled goat cheese. Season with a pinch more salt and pepper. Toss well to mix everything and wilt arugula. Serve immediately, garnished with toasted nuts, if desired."
        },
        {
            "id": 16,
            "name": "Caldo Verde - Portuguese Kale Soup",
            "image": "https://spoonacular.com/recipeImages/636787-312x231.jpg",
            "desc": "Chop your onions, slice your carrots and smash your garlic. Set aside. Peel and chop the potatoes. Set aside in a bowl of cold water. Remove the casing from your chorizo. This is an important step. Chorizo casing is tough and unforgiving and will make the sausage link curl during the cooking process. Just remove it and don't worry about appearance. Cut the links length-wise then chop into half-moons. Sautee in a separate pan until the are nice and browned. Don't put into the pot until the last minute, otherwise the color of the chorizo will leach into the soup turning it a weird red color. Now it's time to prepare the kale. With each individual leaf, cut out the stem. You can do this several ways. Cut a triangle out of the leaf, or fold over the leaf and cut out the stem that way. Or rip off the halves of the leaves off the stem. I like a little bit of stem to give some crunch and texture. Tightly roll the leaf into a bundle. Run your knife over it to julienne the leaf into thin strips. Don't worry if it's not perfect. Set aside the kale. In a big pot, sautee your onions, carrots and garlic in a bit of olive oil. Once the vegetables start to soften, add the potatoes and some crushed red pepper flakes. Stir the pot and cook the potatoes until the outer edges start turning clear. Then add the 6 cups of water and 2 bouillion packets (or 4 cups of broth and 2 cups of water) to the pot. Bring to a boil then let simmer until the potatoes are cooked. With a wooden spoon, mash the potatoes against the side of the pot. Do this until almost all the chunks of potatoes are mashed. Leave some chunks behind. This will give your soup a wonderful hearty texture. Now it's time to add the Kale. It looks like a lot and will fill up your whole pot but not to worry because it wilts down pretty quickly. Cook for 5 minutes at a simmer then stir in chorizo sausage. Serve hot or at room temperature (the latter is my favorite). Eat with a nice crusty loaf of Portuguese bread. Enjoy!"
        }

    ]
}